# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "azure/functions"

# Font
cask "font-fira-code-nerd-font"

# Binaries
brew "asciinema"
brew "autojump"
brew "aws-cdk"
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bat" # better cat
brew "bottom" # better top
brew "certigo"
brew "cfssl"
brew "cmake"
brew "dark-mode"
brew "deno"
brew "dog"
brew "exa" # https://github.com/ogham/exa (Rust "ls")
brew "fnm" # Node version manager
brew "fzf"
brew "gh" # GitHub CLI
brew "gnupg"
brew "go"
brew "goreleaser"
brew "hashicorp/tap/terraform"
brew "helm"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mas" # Mac App Store CLI
brew "neovim" # 'nvim'
brew "node"
brew "pinentry-mac"
brew "protobuf"
brew "postgresql" # psql
brew "ripgrep" # 'rg' better grep
brew "ruby"
brew "rbenv"
brew "ruby-build"
brew "starship"
brew "tree"
brew "vercel-cli"
brew "watch"
brew "watchman"
brew "webp"
brew "yarn"
brew "yq" # jq, but for YAML

# Apps
cask "1password"
cask "1password-cli"
cask "cleanshot"
cask "discord"
cask "docker"
cask "firefox"
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "kaleidoscope"
cask "loom"
cask "notion"
cask "nosql-workbench"
cask "postman"
cask "raycast"
cask "slack"
#cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"

# Mac App Store
#mas "Compressor", id: 424390742
#mas "Final Cut Pro", id: 424389933
#mas "Magnet", id: 441258766
#mas "Xcode", id: 497799835
#mas "Kaleidoscope 3", id: 1575557335
# mas "Transporter", id: 1450874784

