# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"

# Font
cask "font-fira-code-nerd-font"

# Binaries
brew "aws-cdk"
brew "awscli"
brew "bat" # better cat
brew "bottom" # better top
brew "certigo"
brew "cfssl"
brew "charmbracelet/tap/mods"
brew "glow"
brew "cmake"
brew "dark-mode"
brew "dog"
brew "fnm" # Node version manager
brew "fzf"
brew "gh" # GitHub CLI
brew "gnupg"
brew "go"
brew "goreleaser"
brew "hashicorp/tap/terraform"
brew "jq"
brew "lsd" # better ls https://github.com/lsd-rs/lsd
brew "mike-engel/jwt-cli/jwt-cli"
brew "mas" # Mac App Store CLI
brew "neofetch"
brew "neovim" # 'nvim'
brew "node"
brew "pinentry-mac"
brew "protobuf"
brew "postgresql" # psql
brew "pure" # https://github.com/sindresorhus/pure
brew "ripgrep" # 'rg' better grep
brew "ruby"
brew "rbenv"
brew "ruby-build"
brew "tree"
brew "uv" # python dependency manager https://docs.astral.sh/uv/getting-started/installation/#pypi
brew "vercel-cli"
brew "watch"
brew "watchman"
brew "webp"
brew "yarn"
brew "yq" # jq, but for YAML

# Apps
cask "1password"
cask "1password-cli"
cask "cleanshot"
cask "discord"
cask "docker"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "kaleidoscope"
cask "linear-linear"
cask "notion"
cask "postman"
cask "slack"
cask "tableplus"
cask "tuple" # tuple.app
cask "visual-studio-code"
cask "zoom"

# Mac App Store
#mas "Compressor", id: 424390742
#mas "Final Cut Pro", id: 424389933
#mas "Magnet", id: 441258766
#mas "Xcode", id: 497799835
# mas "Transporter", id: 1450874784

