# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# Font
cask "font-fira-code-nerd-font"

# Binaries
brew "autojump"
brew "aws-cdk"
brew "awscli"
brew "bat" # better cat
brew "fnm" # Node version manager
brew "fzf"
brew "gh" # GitHub CLI
brew "gnupg"
brew "go"
brew "goreleaser"
brew "kubectl"
brew "mas" # Mac App Store CLI
brew "neovim" # 'nvim'
brew "node"
brew "pinentry-mac"
brew "ripgrep" # 'rg' better grep
brew "starship"
brew "vercel-cli"
brew "watchman"
brew "yarn"

# Apps
cask "1password"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "notion"
cask "postman"
cask "slack"
cask "steam"
cask "tableplus"
cask 'visual-studio-code'
cask "zoom"

# Mac App Store
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
