amazonwebservices.aws-toolkit-vscode
apollographql.vscode-apollo
bodil.prettier-toml
bradlc.vscode-tailwindcss
bradymholt.pgformatter
bungcip.better-toml
casualjim.gotemplate
christian-kohler.npm-intellisense
ckolkman.vscode-postgres
clinyong.vscode-css-modules
codezombiech.gitignore
csstools.postcss
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
fwcd.kotlin
GitHub.copilot
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
golang.go
GrapeCity.gc-excelviewer
GraphQL.vscode-graphql
hashicorp.terraform
hediet.vscode-drawio
iocave.monkey-patch
Ionide.Ionide-fsharp
jakeboone02.cypher-query-language
jaredly.reason-vscode
Jeraldson.vscode-rusty-onedark
jock.svg
jpoissonnier.vscode-styled-components
KnisterPeter.vscode-github
kumar-harsh.graphql-for-vscode
lfs.vscode-emacs-friendly
MariusAlchimavicius.json-to-ts
mathiasfrohlich.Kotlin
matklad.rust-analyzer
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.mssql
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode.typescript-javascript-grammar
ms-vscode.vscode-typescript-next
ms-vscode.vscode-typescript-tslint-plugin
naumovs.color-highlight
ngryman.codesandbox-theme
pingfromheaven.less-rusty
PKief.material-icon-theme
Prisma.prisma
rbbit.typescript-hero
redhat.java
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust
sdras.night-owl
shakram02.bash-beautify
shd101wyy.markdown-preview-enhanced
silvenon.mdx
Sir2B.lispbeautifier
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
tht13.html-preview-vscode
Tyriar.lorem-ipsum
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wix.vscode-import-cost
wmaurer.change-case
xyc.vscode-mdx-preview
zengxingxin.sort-js-object-keys
zhuangtongfa.material-theme