bbenoist.Nix
bradlc.vscode-tailwindcss
bungcip.better-toml
csstools.postcss
dbaeumer.vscode-eslint
donjayamanne.githistory
esbenp.prettier-vscode
expo.vscode-expo-tools
GitHub.codespaces
GitHub.copilot
GitHub.copilot-labs
GitHub.github-vscode-theme
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
Goopware.raythis
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
hashicorp.hcl
hashicorp.terraform
josetr.cmake-language-support-vscode
MariusAlchimavicius.json-to-ts
me-dutour-mathieu.vscode-github-actions
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-playwright.playwright
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-next
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
naumovs.color-highlight
peterj.proto
PKief.material-icon-theme
pucelle.vscode-css-navigation
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
shakram02.bash-beautify
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
tonka3000.raycast
twxs.cmake
unifiedjs.vscode-mdx
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
waderyan.gitblame
wix.vscode-import-cost
xyc.vscode-mdx-preview
zh9528.file-size
zxh404.vscode-proto3