apollographql.vscode-apollo
bbenoist.Nix
bierner.markdown-mermaid
blanu.vscode-styled-jsx
bradlc.vscode-tailwindcss
bungcip.better-toml
clinyong.vscode-css-modules
csstools.postcss
dbaeumer.vscode-eslint
denoland.vscode-deno
donjayamanne.githistory
dtsvet.vscode-wasm
dunstontc.viml
EditorConfig.EditorConfig
esbenp.prettier-vscode
expo.vscode-expo-tools
fwcd.kotlin
GitHub.codespaces
GitHub.copilot
GitHub.copilot-labs
GitHub.github-vscode-theme
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
Goopware.raythis
GrapeCity.gc-excelviewer
GraphQL.vscode-graphql
GraphQL.vscode-graphql-execution
GraphQL.vscode-graphql-syntax
Gruntfuggly.todo-tree
hashicorp.hcl
hashicorp.terraform
hediet.vscode-drawio
jock.svg
josetr.cmake-language-support-vscode
MariusAlchimavicius.json-to-ts
me-dutour-mathieu.vscode-github-actions
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-playwright.playwright
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
naumovs.color-highlight
Orta.vscode-jest
peterj.proto
PKief.material-icon-theme
Prisma.prisma
pucelle.vscode-css-navigation
qrti.funclist
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
shakram02.bash-beautify
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
tonka3000.raycast
twxs.cmake
Tyriar.lorem-ipsum
unifiedjs.vscode-mdx
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vunguyentuan.vscode-postcss
waderyan.gitblame
withfig.fig
wix.vscode-import-cost
xyc.vscode-mdx-preview
zh9528.file-size
zxh404.vscode-proto3